---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.RevitServerCommunicationException
source: html/c9ef26fb-da38-bb18-58c1-66a7629440a8.htm
---
# RevitServerCommunicationException Members

Retrieves data needed to serialize the target object.